public_html/gphotos_sync.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-03-20 vie 13:37 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>gphotos-sync</title>
<meta name="author" content="Sherlockes" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='https://gongzhitaao.org/orgcss/org.css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">gphotos-sync</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb00732e">1. Instalación en contenedor</a></li>
<li><a href="#orgaf09f53">2. Configuración YAML para Container Manager</a></li>
<li><a href="#orge159ff5">3. Creación de una tarea programada</a></li>
<li><a href="#org0cc98a9">4. Enlaces de interés</a></li>
</ul>
</div>
</div>
<p>
Google Photos Sync descarga todas las fotos y videos subidos a Google Photos, organizándolos localmente según información del álbum. Respaldando también 'Creaciones' como animaciones, panoramas y collages, el software es de solo lectura y no altera la biblioteca en la nube, eliminando así el riesgo de dañar los datos.
</p>

<p>
Ya hace mucho tiempo que uso gphotos-sync para la descarga de mis fotos de la galería de Google Photos tal y como explico este <a href="https://sherblog.pro/backup-de-google-photos/">artículo del blog</a> y en <a href="https://sherblog.pro/sincronizar-google-photos-desde-la-raspberry/">este otro</a>. Hasta ahora el trabajo recaía en la Raspberry que corría el servicio y guardaba las fotos en una carpeta del NAS. Ahora vamos a correr directamente el servicio en el NAS para quitar el trabajo a la Pi.
</p>

<div id="outline-container-orgb00732e" class="outline-2">
<h2 id="orgb00732e"><span class="section-number-2">1.</span> Instalación en contenedor</h2>
<div class="outline-text-2" id="text-1">
<p>
Básicamente, el contenedor necesita dos volúmenes, uno para la ubicación del archivo de configuración "client<sub>secret.json</sub>" y otro almacenar las fotografías descargadas. La <a href="https://gilesknap.github.io/gphotos-sync/main/tutorials/installation.html#execute-in-a-container">guía de instalación</a> oficial es concreta y concisa aunque no presenta el archivo yaml con el que crear un proyecto en container Manager.
</p>
</div>
</div>

<div id="outline-container-orgaf09f53" class="outline-2">
<h2 id="orgaf09f53"><span class="section-number-2">2.</span> Configuración YAML para Container Manager</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-yaml">  <span style="color: #cae682;">services</span>:
  <span style="color: #cae682;">gphotos-sync</span>:
    <span style="color: #cae682;">image</span>: ghcr.io/gilesknap/gphotos-sync
    <span style="color: #cae682;">container_name</span>: gphotos-sync
    <span style="color: #cae682;">volumes</span>:
      - /volume1/homes/sherlockes/.config/gphotos-sync:/config
      - /volume1/homes/sherlockes/gphotos:/storage
    <span style="color: #cae682;">ports</span>:
      - <span style="color: #95e454;">"8080:8080"</span>
    <span style="color: #cae682;">command</span>: /storage
<span style="color: #99968b;">#    </span><span style="color: #99968b;">restart: unless-stopped</span>
</pre>
</div>

<blockquote>
<p>
Es importante que la línea "restart: unless-stopped" esté comentada para que no se aplique ya que de lo contrario el contenedor se estaría ejecutando continuamente a la búsqueda de nuevas imágenes.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orge159ff5" class="outline-2">
<h2 id="orge159ff5"><span class="section-number-2">3.</span> Creación de una tarea programada</h2>
<div class="outline-text-2" id="text-3">
<p>
Vamos a hacer que se ejecute el contenedor un par de veces a la semana mediante la creación de una tarea programada con las siguientes características
</p>

<ul class="org-ul">
<li>Nombre: gphotos-sync</li>
<li>Usuario: Root</li>
<li>Repetir: Semanalmente el Domingo y Miércoles</li>
<li>Script: <code>synowebapi --exec api=SYNO.Docker.Container version=1 method=start name="gphotos-sync"</code></li>
</ul>
</div>
</div>

<div id="outline-container-org0cc98a9" class="outline-2">
<h2 id="org0cc98a9"><span class="section-number-2">4.</span> Enlaces de interés</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="https://gilesknap.github.io/gphotos-sync/main/index.html">https://gilesknap.github.io/gphotos-sync/main/index.html</a></li>
<li><a href="https://mariushosting.com/synology-schedule-start-stop-for-docker-containers/">https://mariushosting.com/synology-schedule-start-stop-for-docker-containers/</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-02-01</p>
<p class="author">Author: Sherlockes</p>
<p class="date">Created: 2026-03-20 vie 13:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
